Repository: eilyich/easy_currency_calc
Catalog: lib/l10n/intl_*.arb
Languages: ru

# mainCurUpdated
source: Rates updated
ru: Курсы обновлены

# mainInfo
source: Info
ru: Инфо

# mainTheme
source: Theme
ru: Тема

# mainUpdate
source: Rates
ru: Курс

# mainLang
source: Language
ru: Язык

# exceptionRateFailure
source: Exchange rates fetching failure
ru: Не удалось получить обменный курс

# exceptionCheckConn
source: Check Internet connection...
ru: Проверьте соединение с Интернетом...

# mainRatesLoading
source: Loading exchange rates
ru: Загрузка обменного курса

# mainDisclamer1
source: Simple currency converter created for your convenience. For any questions feel free to
ru: Простой конвертер валют создан для вашего удобства. Буду рад любым пожеланиям и благодарностям,

# mainDiclamer2
source: mail me!
ru: пишите!

# mainAbout
source: About
ru: О приожении

# mainSearch
source: Search
ru: Поиск

# exceptionMaximumRows
source: Row number limit reached
ru: Достигнут лимит количества строк

# drawerChangeTheme
source: Change theme
ru: Цветовая схема

# drawerRemoveAds
source: Pro version
ru: Отключить рекламу

# miscAds
source: You're lucky! There are no ads anyway!
ru: Вам повезло! Рекламы и так нет!

# drawerLanguage
source: Language
ru: Язык

# miscHelp
source: Help
ru: Помощь

# helpScreenRefresh
source: Exchange rates are loaded online. But no worries if there's no internet! You can still perform calculations based on the rate from the last load.
ru: Обменные курсы загружаются онлайн. Но если нет интернета - не беда! Вы всё равно можете проводить расчёты на основе курса из прошлой загрузки.

# helpScreenAllCurrencys
source: Add the currencies you need using the '+' button. The list includes over 50 currencies from around the world, as well as precious metals and Bitcoin.
ru: Добавляйте нужные валюты с помощью кнопки '+'. В списке более 50 валют со всего мира, а также драгоценные металлы и Биткоин.

# helpScreenIsActive
source: The active currency is the one against which calculations are made in other currencies. It is always in the field where you entered the number.
ru: Активная валюта - это та, по отношению к которой происходят вычисления в других валютах. Она всегда находится в том поле, где вы ввели число.

# helpScreenSettingsIntro
source: You can always customize the calculation field to suit your needs:
ru: Вы всегда можете настроить поле расчётов под свои нужды:

# helpScreenSettingsDelete
source: If a currency is no longer needed, it can be removed from the list.
ru: Если валюта больше не нужна, её можно удалить из списка.

# helpScreenSettingsReorder
source: In the settings mode, you can swap currencies around - so the most important ones are where it's convenient!
ru: В режиме настройки можно менять валюты местами - чтобы самое важное было там где удобно!

# helpScreenComment
source: (Currently, the settings mode can only be activated when the input fields for amounts are empty. We are working on improving the user experience and will change this mechanism in the future).
ru: (Пока режим настройки можно активизировать только когда поля ввода сумм пусты. Мы работаем над улучшением пользовательского опыта, и изменим эту механику в дальнейшем).
